RIOT-OS/RIOT/cpu/StellarisWare/inc/lm4f122h5qd.h
//*****************************************************************************
//
// GPIO registers (PORTH AHB)
//
//*****************************************************************************
#define GPIO_PORTH_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x4005F000)
#define GPIO_PORTH_AHB_DATA_R   (*((volatile unsigned long *)0x4005F3FC))
#define GPIO_PORTH_AHB_DIR_R    (*((volatile unsigned long *)0x4005F400))
#define GPIO_PORTH_AHB_IS_R     (*((volatile unsigned long *)0x4005F404))
#define GPIO_PORTH_AHB_IBE_R    (*((volatile unsigned long *)0x4005F408))
#define GPIO_PORTH_AHB_IEV_R    (*((volatile unsigned long *)0x4005F40C))
#define GPIO_PORTH_AHB_IM_R     (*((volatile unsigned long *)0x4005F410))
#define GPIO_PORTH_AHB_RIS_R    (*((volatile unsigned long *)0x4005F414))
#define GPIO_PORTH_AHB_MIS_R    (*((volatile unsigned long *)0x4005F418))
#define GPIO_PORTH_AHB_ICR_R    (*((volatile unsigned long *)0x4005F41C))
#define GPIO_PORTH_AHB_AFSEL_R  (*((volatile unsigned long *)0x4005F420))
#define GPIO_PORTH_AHB_DR2R_R   (*((volatile unsigned long *)0x4005F500))
#define GPIO_PORTH_AHB_DR4R_R   (*((volatile unsigned long *)0x4005F504))
#define GPIO_PORTH_AHB_DR8R_R   (*((volatile unsigned long *)0x4005F508))
#define GPIO_PORTH_AHB_ODR_R    (*((volatile unsigned long *)0x4005F50C))
#define GPIO_PORTH_AHB_PUR_R    (*((volatile unsigned long *)0x4005F510))
#define GPIO_PORTH_AHB_PDR_R    (*((volatile unsigned long *)0x4005F514))
#define GPIO_PORTH_AHB_SLR_R    (*((volatile unsigned long *)0x4005F518))
#define GPIO_PORTH_AHB_DEN_R    (*((volatile unsigned long *)0x4005F51C))
#define GPIO_PORTH_AHB_LOCK_R   (*((volatile unsigned long *)0x4005F520))
#define GPIO_PORTH_AHB_CR_R     (*((volatile unsigned long *)0x4005F524))
#define GPIO_PORTH_AHB_AMSEL_R  (*((volatile unsigned long *)0x4005F528))
#define GPIO_PORTH_AHB_PCTL_R   (*((volatile unsigned long *)0x4005F52C))
#define GPIO_PORTH_AHB_ADCCTL_R (*((volatile unsigned long *)0x4005F530))
#define GPIO_PORTH_AHB_DMACTL_R (*((volatile unsigned long *)0x4005F534))
#define GPIO_PORTH_AHB_SI_R     (*((volatile unsigned long *)0x4005F538))

//*****************************************************************************
//
// GPIO registers (PORTJ AHB)
//
//*****************************************************************************
#define GPIO_PORTJ_AHB_DATA_BITS_R \
                                ((volatile unsigned long *)0x40060000)
#define GPIO_PORTJ_AHB_DATA_R   (*((volatile unsigned long *)0x400603FC))
#define GPIO_PORTJ_AHB_DIR_R    (*((volatile unsigned long *)0x40060400))
#define GPIO_PORTJ_AHB_IS_R     (*((volatile unsigned long *)0x40060404))
#define GPIO_PORTJ_AHB_IBE_R    (*((volatile unsigned long *)0x40060408))
#define GPIO_PORTJ_AHB_IEV_R    (*((volatile unsigned long *)0x4006040C))
#define GPIO_PORTJ_AHB_IM_R     (*((volatile unsigned long *)0x40060410))
#define GPIO_PORTJ_AHB_RIS_R    (*((volatile unsigned long *)0x40060414))
#define GPIO_PORTJ_AHB_MIS_R    (*((volatile unsigned long *)0x40060418))
#define GPIO_PORTJ_AHB_ICR_R    (*((volatile unsigned long *)0x4006041C))
#define GPIO_PORTJ_AHB_AFSEL_R  (*((volatile unsigned long *)0x40060420))
#define GPIO_PORTJ_AHB_DR2R_R   (*((volatile unsigned long *)0x40060500))
#define GPIO_PORTJ_AHB_DR4R_R   (*((volatile unsigned long *)0x40060504))
#define GPIO_PORTJ_AHB_DR8R_R   (*((volatile unsigned long *)0x40060508))
#define GPIO_PORTJ_AHB_ODR_R    (*((volatile unsigned long *)0x4006050C))
#define GPIO_PORTJ_AHB_PUR_R    (*((volatile unsigned long *)0x40060510))
#define GPIO_PORTJ_AHB_PDR_R    (*((volatile unsigned long *)0x40060514))
#define GPIO_PORTJ_AHB_SLR_R    (*((volatile unsigned long *)0x40060518))
#define GPIO_PORTJ_AHB_DEN_R    (*((volatile unsigned long *)0x4006051C))
#define GPIO_PORTJ_AHB_LOCK_R   (*((volatile unsigned long *)0x40060520))
#define GPIO_PORTJ_AHB_CR_R     (*((volatile unsigned long *)0x40060524))
#define GPIO_PORTJ_AHB_AMSEL_R  (*((volatile unsigned long *)0x40060528))
#define GPIO_PORTJ_AHB_PCTL_R   (*((volatile unsigned long *)0x4006052C))
#define GPIO_PORTJ_AHB_ADCCTL_R (*((volatile unsigned long *)0x40060530))
#define GPIO_PORTJ_AHB_DMACTL_R (*((volatile unsigned long *)0x40060534))
#define GPIO_PORTJ_AHB_SI_R     (*((volatile unsigned long *)0x40060538))

//*****************************************************************************
//
// GPIO registers (PORTK)
//
//*****************************************************************************
#define GPIO_PORTK_DATA_BITS_R  ((volatile unsigned long *)0x40061000)
#define GPIO_PORTK_DATA_R       (*((volatile unsigned long *)0x400613FC))
#define GPIO_PORTK_DIR_R        (*((volatile unsigned long *)0x40061400))
#define GPIO_PORTK_IS_R         (*((volatile unsigned long *)0x40061404))
#define GPIO_PORTK_IBE_R        (*((volatile unsigned long *)0x40061408))
#define GPIO_PORTK_IEV_R        (*((volatile unsigned long *)0x4006140C))
#define GPIO_PORTK_IM_R         (*((volatile unsigned long *)0x40061410))
#define GPIO_PORTK_RIS_R        (*((volatile unsigned long *)0x40061414))
#define GPIO_PORTK_MIS_R        (*((volatile unsigned long *)0x40061418))
#define GPIO_PORTK_ICR_R        (*((volatile unsigned long *)0x4006141C))
#define GPIO_PORTK_AFSEL_R      (*((volatile unsigned long *)0x40061420))
#define GPIO_PORTK_DR2R_R       (*((volatile unsigned long *)0x40061500))
#define GPIO_PORTK_DR4R_R       (*((volatile unsigned long *)0x40061504))
#define GPIO_PORTK_DR8R_R       (*((volatile unsigned long *)0x40061508))
#define GPIO_PORTK_ODR_R        (*((volatile unsigned long *)0x4006150C))
#define GPIO_PORTK_PUR_R        (*((volatile unsigned long *)0x40061510))
#define GPIO_PORTK_PDR_R        (*((volatile unsigned long *)0x40061514))
#define GPIO_PORTK_SLR_R        (*((volatile unsigned long *)0x40061518))
#define GPIO_PORTK_DEN_R        (*((volatile unsigned long *)0x4006151C))
#define GPIO_PORTK_LOCK_R       (*((volatile unsigned long *)0x40061520))
#define GPIO_PORTK_CR_R         (*((volatile unsigned long *)0x40061524))
#define GPIO_PORTK_AMSEL_R      (*((volatile unsigned long *)0x40061528))
#define GPIO_PORTK_PCTL_R       (*((volatile unsigned long *)0x4006152C))
#define GPIO_PORTK_ADCCTL_R     (*((volatile unsigned long *)0x40061530))
#define GPIO_PORTK_DMACTL_R     (*((volatile unsigned long *)0x40061534))
#define GPIO_PORTK_SI_R         (*((volatile unsigned long *)0x40061538))

//*****************************************************************************
//
// GPIO registers (PORTL)
//
//*****************************************************************************
#define GPIO_PORTL_DATA_BITS_R  ((volatile unsigned long *)0x40062000)
#define GPIO_PORTL_DATA_R       (*((volatile unsigned long *)0x400623FC))
#define GPIO_PORTL_DIR_R        (*((volatile unsigned long *)0x40062400))
#define GPIO_PORTL_IS_R         (*((volatile unsigned long *)0x40062404))
#define GPIO_PORTL_IBE_R        (*((volatile unsigned long *)0x40062408))
#define GPIO_PORTL_IEV_R        (*((volatile unsigned long *)0x4006240C))
#define GPIO_PORTL_IM_R         (*((volatile unsigned long *)0x40062410))
#define GPIO_PORTL_RIS_R        (*((volatile unsigned long *)0x40062414))
#define GPIO_PORTL_MIS_R        (*((volatile unsigned long *)0x40062418))
#define GPIO_PORTL_ICR_R        (*((volatile unsigned long *)0x4006241C))
#define GPIO_PORTL_AFSEL_R      (*((volatile unsigned long *)0x40062420))
#define GPIO_PORTL_DR2R_R       (*((volatile unsigned long *)0x40062500))
#define GPIO_PORTL_DR4R_R       (*((volatile unsigned long *)0x40062504))
#define GPIO_PORTL_DR8R_R       (*((volatile unsigned long *)0x40062508))
#define GPIO_PORTL_ODR_R        (*((volatile unsigned long *)0x4006250C))
#define GPIO_PORTL_PUR_R        (*((volatile unsigned long *)0x40062510))
#define GPIO_PORTL_PDR_R        (*((volatile unsigned long *)0x40062514))
#define GPIO_PORTL_SLR_R        (*((volatile unsigned long *)0x40062518))
#define GPIO_PORTL_DEN_R        (*((volatile unsigned long *)0x4006251C))
#define GPIO_PORTL_LOCK_R       (*((volatile unsigned long *)0x40062520))
#define GPIO_PORTL_CR_R         (*((volatile unsigned long *)0x40062524))
#define GPIO_PORTL_AMSEL_R      (*((volatile unsigned long *)0x40062528))
#define GPIO_PORTL_PCTL_R       (*((volatile unsigned long *)0x4006252C))
#define GPIO_PORTL_ADCCTL_R     (*((volatile unsigned long *)0x40062530))
#define GPIO_PORTL_DMACTL_R     (*((volatile unsigned long *)0x40062534))
#define GPIO_PORTL_SI_R         (*((volatile unsigned long *)0x40062538))

//*****************************************************************************
//
// GPIO registers (PORTM)
//
//*****************************************************************************
#define GPIO_PORTM_DATA_BITS_R  ((volatile unsigned long *)0x40063000)
#define GPIO_PORTM_DATA_R       (*((volatile unsigned long *)0x400633FC))
#define GPIO_PORTM_DIR_R        (*((volatile unsigned long *)0x40063400))
#define GPIO_PORTM_IS_R         (*((volatile unsigned long *)0x40063404))
#define GPIO_PORTM_IBE_R        (*((volatile unsigned long *)0x40063408))
#define GPIO_PORTM_IEV_R        (*((volatile unsigned long *)0x4006340C))
#define GPIO_PORTM_IM_R         (*((volatile unsigned long *)0x40063410))
#define GPIO_PORTM_RIS_R        (*((volatile unsigned long *)0x40063414))
#define GPIO_PORTM_MIS_R        (*((volatile unsigned long *)0x40063418))
#define GPIO_PORTM_ICR_R        (*((volatile unsigned long *)0x4006341C))
#define GPIO_PORTM_AFSEL_R      (*((volatile unsigned long *)0x40063420))
#define GPIO_PORTM_DR2R_R       (*((volatile unsigned long *)0x40063500))
#define GPIO_PORTM_DR4R_R       (*((volatile unsigned long *)0x40063504))
#define GPIO_PORTM_DR8R_R       (*((volatile unsigned long *)0x40063508))
#define GPIO_PORTM_ODR_R        (*((volatile unsigned long *)0x4006350C))
#define GPIO_PORTM_PUR_R        (*((volatile unsigned long *)0x40063510))
#define GPIO_PORTM_PDR_R        (*((volatile unsigned long *)0x40063514))
#define GPIO_PORTM_SLR_R        (*((volatile unsigned long *)0x40063518))
#define GPIO_PORTM_DEN_R        (*((volatile unsigned long *)0x4006351C))
#define GPIO_PORTM_LOCK_R       (*((volatile unsigned long *)0x40063520))
#define GPIO_PORTM_CR_R         (*((volatile unsigned long *)0x40063524))
#define GPIO_PORTM_AMSEL_R      (*((volatile unsigned long *)0x40063528))
#define GPIO_PORTM_PCTL_R       (*((volatile unsigned long *)0x4006352C))
#define GPIO_PORTM_ADCCTL_R     (*((volatile unsigned long *)0x40063530))
#define GPIO_PORTM_DMACTL_R     (*((volatile unsigned long *)0x40063534))
#define GPIO_PORTM_SI_R         (*((volatile unsigned long *)0x40063538))

//*****************************************************************************
//
// GPIO registers (PORTN)
//
//*****************************************************************************
#define GPIO_PORTN_DATA_BITS_R  ((volatile unsigned long *)0x40064000)
#define GPIO_PORTN_DATA_R       (*((volatile unsigned long *)0x400643FC))
#define GPIO_PORTN_DIR_R        (*((volatile unsigned long *)0x40064400))
#define GPIO_PORTN_IS_R         (*((volatile unsigned long *)0x40064404))
#define GPIO_PORTN_IBE_R        (*((volatile unsigned long *)0x40064408))
#define GPIO_PORTN_IEV_R        (*((volatile unsigned long *)0x4006440C))
#define GPIO_PORTN_IM_R         (*((volatile unsigned long *)0x40064410))
#define GPIO_PORTN_RIS_R        (*((volatile unsigned long *)0x40064414))
#define GPIO_PORTN_MIS_R        (*((volatile unsigned long *)0x40064418))
#define GPIO_PORTN_ICR_R        (*((volatile unsigned long *)0x4006441C))
#define GPIO_PORTN_AFSEL_R      (*((volatile unsigned long *)0x40064420))
#define GPIO_PORTN_DR2R_R       (*((volatile unsigned long *)0x40064500))
#define GPIO_PORTN_DR4R_R       (*((volatile unsigned long *)0x40064504))
#define GPIO_PORTN_DR8R_R       (*((volatile unsigned long *)0x40064508))
#define GPIO_PORTN_ODR_R        (*((volatile unsigned long *)0x4006450C))
#define GPIO_PORTN_PUR_R        (*((volatile unsigned long *)0x40064510))
#define GPIO_PORTN_PDR_R        (*((volatile unsigned long *)0x40064514))
#define GPIO_PORTN_SLR_R        (*((volatile unsigned long *)0x40064518))
#define GPIO_PORTN_DEN_R        (*((volatile unsigned long *)0x4006451C))
#define GPIO_PORTN_LOCK_R       (*((volatile unsigned long *)0x40064520))
#define GPIO_PORTN_CR_R         (*((volatile unsigned long *)0x40064524))
#define GPIO_PORTN_AMSEL_R      (*((volatile unsigned long *)0x40064528))
#define GPIO_PORTN_PCTL_R       (*((volatile unsigned long *)0x4006452C))
#define GPIO_PORTN_ADCCTL_R     (*((volatile unsigned long *)0x40064530))
#define GPIO_PORTN_DMACTL_R     (*((volatile unsigned long *)0x40064534))
#define GPIO_PORTN_SI_R         (*((volatile unsigned long *)0x40064538))

//*****************************************************************************
//
// GPIO registers (PORTP)
//
//*****************************************************************************
#define GPIO_PORTP_DATA_BITS_R  ((volatile unsigned long *)0x40065000)
#define GPIO_PORTP_DATA_R       (*((volatile unsigned long *)0x400653FC))
#define GPIO_PORTP_DIR_R        (*((volatile unsigned long *)0x40065400))
#define GPIO_PORTP_IS_R         (*((volatile unsigned long *)0x40065404))
#define GPIO_PORTP_IBE_R        (*((volatile unsigned long *)0x40065408))
#define GPIO_PORTP_IEV_R        (*((volatile unsigned long *)0x4006540C))
#define GPIO_PORTP_IM_R         (*((volatile unsigned long *)0x40065410))
#define GPIO_PORTP_RIS_R        (*((volatile unsigned long *)0x40065414))
#define GPIO_PORTP_MIS_R        (*((volatile unsigned long *)0x40065418))
#define GPIO_PORTP_ICR_R        (*((volatile unsigned long *)0x4006541C))
#define GPIO_PORTP_AFSEL_R      (*((volatile unsigned long *)0x40065420))
#define GPIO_PORTP_DR2R_R       (*((volatile unsigned long *)0x40065500))
#define GPIO_PORTP_DR4R_R       (*((volatile unsigned long *)0x40065504))
#define GPIO_PORTP_DR8R_R       (*((volatile unsigned long *)0x40065508))
#define GPIO_PORTP_ODR_R        (*((volatile unsigned long *)0x4006550C))
#define GPIO_PORTP_PUR_R        (*((volatile unsigned long *)0x40065510))
#define GPIO_PORTP_PDR_R        (*((volatile unsigned long *)0x40065514))
#define GPIO_PORTP_SLR_R        (*((volatile unsigned long *)0x40065518))
#define GPIO_PORTP_DEN_R        (*((volatile unsigned long *)0x4006551C))
#define GPIO_PORTP_LOCK_R       (*((volatile unsigned long *)0x40065520))
#define GPIO_PORTP_CR_R         (*((volatile unsigned long *)0x40065524))
#define GPIO_PORTP_AMSEL_R      (*((volatile unsigned long *)0x40065528))
#define GPIO_PORTP_PCTL_R       (*((volatile unsigned long *)0x4006552C))
#define GPIO_PORTP_ADCCTL_R     (*((volatile unsigned long *)0x40065530))
#define GPIO_PORTP_DMACTL_R     (*((volatile unsigned long *)0x40065534))
#define GPIO_PORTP_SI_R         (*((volatile unsigned long *)0x40065538))

//*****************************************************************************
//
// EEPROM registers (EEPROM)
//
//*****************************************************************************
#define EEPROM_EESIZE_R         (*((volatile unsigned long *)0x400AF000))
#define EEPROM_EEBLOCK_R        (*((volatile unsigned long *)0x400AF004))
#define EEPROM_EEOFFSET_R       (*((volatile unsigned long *)0x400AF008))
#define EEPROM_EERDWR_R         (*((volatile unsigned long *)0x400AF010))
#define EEPROM_EERDWRINC_R      (*((volatile unsigned long *)0x400AF014))
#define EEPROM_EEDONE_R         (*((volatile unsigned long *)0x400AF018))
#define EEPROM_EESUPP_R         (*((volatile unsigned long *)0x400AF01C))
#define EEPROM_EEUNLOCK_R       (*((volatile unsigned long *)0x400AF020))
#define EEPROM_EEPROT_R         (*((volatile unsigned long *)0x400AF030))
#define EEPROM_EEPASS0_R        (*((volatile unsigned long *)0x400AF034))
#define EEPROM_EEPASS1_R        (*((volatile unsigned long *)0x400AF038))
#define EEPROM_EEPASS2_R        (*((volatile unsigned long *)0x400AF03C))
#define EEPROM_EEINT_R          (*((volatile unsigned long *)0x400AF040))
#define EEPROM_EEHIDE_R         (*((volatile unsigned long *)0x400AF050))
#define EEPROM_EEDBGME_R        (*((volatile unsigned long *)0x400AF080))
#define EEPROM_PP_R             (*((volatile unsigned long *)0x400AFFC0))

//*****************************************************************************
//
// I2C registers (I2C4 MASTER)
//
//*****************************************************************************
#define I2C4_MASTER_MSA_R       (*((volatile unsigned long *)0x400C0000))
#define I2C4_MASTER_MCS_R       (*((volatile unsigned long *)0x400C0004))
#define I2C4_MASTER_MDR_R       (*((volatile unsigned long *)0x400C0008))
#define I2C4_MASTER_MTPR_R      (*((volatile unsigned long *)0x400C000C))
#define I2C4_MASTER_MIMR_R      (*((volatile unsigned long *)0x400C0010))
#define I2C4_MASTER_MRIS_R      (*((volatile unsigned long *)0x400C0014))
#define I2C4_MASTER_MMIS_R      (*((volatile unsigned long *)0x400C0018))
#define I2C4_MASTER_MICR_R      (*((volatile unsigned long *)0x400C001C))
#define I2C4_MASTER_MCR_R       (*((volatile unsigned long *)0x400C0020))
#define I2C4_MASTER_MCLKOCNT_R  (*((volatile unsigned long *)0x400C0024))
#define I2C4_MASTER_MBMON_R     (*((volatile unsigned long *)0x400C002C))

//*****************************************************************************
//
// I2C registers (I2C4 SLAVE)
//
//*****************************************************************************
#define I2C4_SLAVE_SOAR_R       (*((volatile unsigned long *)0x400C0800))
#define I2C4_SLAVE_SCSR_R       (*((volatile unsigned long *)0x400C0804))
#define I2C4_SLAVE_SDR_R        (*((volatile unsigned long *)0x400C0808))
#define I2C4_SLAVE_SIMR_R       (*((volatile unsigned long *)0x400C080C))
#define I2C4_SLAVE_SRIS_R       (*((volatile unsigned long *)0x400C0810))
#define I2C4_SLAVE_SMIS_R       (*((volatile unsigned long *)0x400C0814))
#define I2C4_SLAVE_SICR_R       (*((volatile unsigned long *)0x400C0818))
#define I2C4_SLAVE_SOAR2_R      (*((volatile unsigned long *)0x400C081C))
#define I2C4_SLAVE_SACKCTL_R    (*((volatile unsigned long *)0x400C0820))

//*****************************************************************************
//
// I2C registers (I2C5 MASTER)
//
//*****************************************************************************
#define I2C5_MASTER_MSA_R       (*((volatile unsigned long *)0x400C1000))
#define I2C5_MASTER_MCS_R       (*((volatile unsigned long *)0x400C1004))
#define I2C5_MASTER_MDR_R       (*((volatile unsigned long *)0x400C1008))
#define I2C5_MASTER_MTPR_R      (*((volatile unsigned long *)0x400C100C))
#define I2C5_MASTER_MIMR_R      (*((volatile unsigned long *)0x400C1010))
#define I2C5_MASTER_MRIS_R      (*((volatile unsigned long *)0x400C1014))
#define I2C5_MASTER_MMIS_R      (*((volatile unsigned long *)0x400C1018))
#define I2C5_MASTER_MICR_R      (*((volatile unsigned long *)0x400C101C))
#define I2C5_MASTER_MCR_R       (*((volatile unsigned long *)0x400C1020))
#define I2C5_MASTER_MCLKOCNT_R  (*((volatile unsigned long *)0x400C1024))
#define I2C5_MASTER_MBMON_R     (*((volatile unsigned long *)0x400C102C))

//*****************************************************************************
//
// I2C registers (I2C5 SLAVE)
//
//*****************************************************************************
#define I2C5_SLAVE_SOAR_R       (*((volatile unsigned long *)0x400C1800))
#define I2C5_SLAVE_SCSR_R       (*((volatile unsigned long *)0x400C1804))
#define I2C5_SLAVE_SDR_R        (*((volatile unsigned long *)0x400C1808))
#define I2C5_SLAVE_SIMR_R       (*((volatile unsigned long *)0x400C180C))
#define I2C5_SLAVE_SRIS_R       (*((volatile unsigned long *)0x400C1810))
#define I2C5_SLAVE_SMIS_R       (*((volatile unsigned long *)0x400C1814))
#define I2C5_SLAVE_SICR_R       (*((volatile unsigned long *)0x400C1818))
#define I2C5_SLAVE_SOAR2_R      (*((volatile unsigned long *)0x400C181C))
#define I2C5_SLAVE_SACKCTL_R    (*((volatile unsigned long *)0x400C1820))

//*****************************************************************************
//
// System Exception Module registers (SYSEXC)
//
//*****************************************************************************
#define SYSEXC_RIS_R            (*((volatile unsigned long *)0x400F9000))
#define SYSEXC_IM_R             (*((volatile unsigned long *)0x400F9004))
#define SYSEXC_MIS_R            (*((volatile unsigned long *)0x400F9008))
#define SYSEXC_IC_R             (*((volatile unsigned long *)0x400F900C))

//*****************************************************************************
//
// Hibernation module registers (HIB)
//
//*****************************************************************************
#define HIB_RTCC_R              (*((volatile unsigned long *)0x400FC000))
#define HIB_RTCM0_R             (*((volatile unsigned long *)0x400FC004))
#define HIB_RTCLD_R             (*((volatile unsigned long *)0x400FC00C))
#define HIB_CTL_R               (*((volatile unsigned long *)0x400FC010))
#define HIB_IM_R                (*((volatile unsigned long *)0x400FC014))
#define HIB_RIS_R               (*((volatile unsigned long *)0x400FC018))
#define HIB_MIS_R               (*((volatile unsigned long *)0x400FC01C))
#define HIB_IC_R                (*((volatile unsigned long *)0x400FC020))
#define HIB_RTCT_R              (*((volatile unsigned long *)0x400FC024))
#define HIB_RTCSS_R             (*((volatile unsigned long *)0x400FC028))
#define HIB_DATA_R              (*((volatile unsigned long *)0x400FC030))

